app/controllers/api/v1/dashboard_controller.rb

SELECT  "recently_heards".* FROM "recently_heards" WHERE "recently_heards"."user_id" = ? ORDER BY created_at DESC LIMIT ?  [["user_id", 2], ["LIMIT", 4]]
---
    def load_recent_heard
      @recent_albums = current_user.recently_heards.order("created_at DESC").limit(4).map(&:album).uniq